<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"8b8bc7fb902d9b6efa98b67c9794057554d31b9e8f802554a9d3b6c91e62bcbb","plan_job_ref":"Job Create Terraform plan (DEV) #32 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14856498605","plan_out_hash":"1cead562d86493f762fe37b601ad9f0dc8067b5dcefe09b82fffe6fb73c5b7a9","plan_hash":"339d9398ff3fb86da0d5f7ba30dae98a6f77f17e806f15ba232cdd6519807c33","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
With var files: `terraform/dev/dev.tfvars`
<details>
<summary>Plan: 33 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.db_admin_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_admin_password" {
+       content_type            = (known after apply)
+       expiration_date         = (known after apply)
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "sql-admin-password"
+       not_before_date         = (known after apply)
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       tags                    = (known after apply)
+       value                   = (sensitive value)
+       versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sql_admin_password will be created
+   resource "azurerm_key_vault_secret" "sql_admin_password" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "sql-admin-password"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # random_password.sql_admin will be created
+   resource "random_password" "sql_admin" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 16
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "!@#%&*()-_=+<>?/"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

  # module.acr.azurerm_container_registry.acr will be created
+   resource "azurerm_container_registry" "acr" {
+       admin_enabled                 = false
+       admin_password                = (sensitive value)
+       admin_username                = (known after apply)
+       encryption                    = (known after apply)
+       export_policy_enabled         = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       login_server                  = (known after apply)
+       name                          = "openmrscoredevacr"
+       network_rule_bypass_option    = "AzureServices"
+       network_rule_set              = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "rg-openmrscore-dev"
+       sku                           = "Basic"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       trust_policy_enabled          = false
+       zone_redundancy_enabled       = false
    }

  # module.container_app.azurerm_container_app.backend[0] will be created
+   resource "azurerm_container_app" "backend" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openmrscore-dev-app-backend"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openmrscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       workload_profile_name         = "Consumption"

+       identity {
+           identity_ids = (known after apply)
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = true
+           custom_domain              = (known after apply)
+           external_enabled           = true
+           fqdn                       = (known after apply)
+           target_port                = 8080
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = (known after apply)
+           server   = (known after apply)
        }

+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1.5
+               ephemeral_storage = (known after apply)
+               image             = "openmrscoredevacr.azurecr.io/openmrscore-backend:latest"
+               memory            = "3Gi"
+               name              = "backend"

+               env {
+                   name        = "OMRS_CONFIG_AUTO_UPDATE_DATABASE"
+                   secret_name = "omrs-config-auto-update-database"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_DATABASE"
+                   secret_name = "omrs-config-connection-database"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_PASSWORD"
+                   secret_name = "omrs-config-connection-password"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_SERVER"
+                   secret_name = "omrs-config-connection-server"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_USERNAME"
+                   secret_name = "omrs-config-connection-username"
                }
+               env {
+                   name        = "OMRS_CONFIG_CREATE_TABLES"
+                   secret_name = "omrs-config-create-tables"
                }
+               env {
+                   name        = "OMRS_CONFIG_MODULE_WEB_ADMIN"
+                   secret_name = "omrs-config-module-web-admin"
                }

+               volume_mounts {
+                   name = "openmrs-data"
+                   path = "/openmrs/data"
                }
            }

+           volume {
+               name         = "openmrs-data"
+               storage_name = (sensitive value)
+               storage_type = "AzureFile"
            }
        }
    }

  # module.container_app.azurerm_container_app.frontend[0] will be created
+   resource "azurerm_container_app" "frontend" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openmrscore-dev-app-frontend"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openmrscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       workload_profile_name         = "Consumption"

+       identity {
+           identity_ids = (known after apply)
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = true
+           custom_domain              = (known after apply)
+           external_enabled           = true
+           fqdn                       = (known after apply)
+           target_port                = 80
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = (known after apply)
+           server   = (known after apply)
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1.5
+               ephemeral_storage = (known after apply)
+               image             = "openmrscoredevacr.azurecr.io/openmrscore-frontend:latest"
+               memory            = "3Gi"
+               name              = "frontend"

+               env {
+                   name  = "API_URL"
+                   value = "/openmrs"
                }
+               env {
+                   name  = "SPA_CONFIG_URLS"
+                   value = "/openmrs/spa/config-core_demo.json"
                }
+               env {
+                   name  = "SPA_DEFAULT_LOCALE"
#                    (1 unchanged attribute hidden)
                }
+               env {
+                   name  = "SPA_PATH"
+                   value = "/openmrs/spa"
                }
            }
        }
    }

  # module.container_app.azurerm_container_app.gateway[0] will be created
+   resource "azurerm_container_app" "gateway" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openmrscore-dev-app-gateway"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openmrscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       workload_profile_name         = "Consumption"

+       identity {
+           identity_ids = (known after apply)
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = true
+           custom_domain              = (known after apply)
+           external_enabled           = true
+           fqdn                       = (known after apply)
+           target_port                = 80
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = (known after apply)
+           server   = (known after apply)
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openmrscoredevacr.azurecr.io/openmrscore-gateway:latest"
+               memory            = "2Gi"
+               name              = "gateway"

+               env {
+                   name  = "BACKEND_URL"
+                   value = "openmrscore-dev-app-backend"
                }
+               env {
+                   name  = "FRONTEND_URL"
+                   value = "openmrscore-dev-app-frontend"
                }
            }
        }
    }

  # module.container_app.azurerm_container_app_environment.this will be created
+   resource "azurerm_container_app_environment" "this" {
+       custom_domain_verification_id    = (known after apply)
+       default_domain                   = (known after apply)
+       docker_bridge_cidr               = (known after apply)
+       id                               = (known after apply)
+       infrastructure_subnet_id         = (known after apply)
+       internal_load_balancer_enabled   = false
+       location                         = "francecentral"
+       log_analytics_workspace_id       = (known after apply)
+       logs_destination                 = "log-analytics"
+       mutual_tls_enabled               = false
+       name                             = "openmrscore-dev-env"
+       platform_reserved_cidr           = (known after apply)
+       platform_reserved_dns_ip_address = (known after apply)
+       resource_group_name              = "rg-openmrscore-dev"
+       static_ip_address                = (known after apply)
+       tags                             = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       zone_redundancy_enabled          = false

+       workload_profile {
+           maximum_count         = 3
+           minimum_count         = 1
+           name                  = "Consumption"
+           workload_profile_type = "Consumption"
        }
    }

  # module.container_app.azurerm_container_app_environment_storage.this will be created
+   resource "azurerm_container_app_environment_storage" "this" {
+       access_key                   = (sensitive value)
+       access_mode                  = (sensitive value)
+       account_name                 = (sensitive value)
+       container_app_environment_id = (known after apply)
+       id                           = (known after apply)
+       name                         = (sensitive value)
+       share_name                   = (sensitive value)
    }

  # module.container_uai.azurerm_role_assignment.this["acr-pull"] will be created
+   resource "azurerm_role_assignment" "this" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.container_uai.azurerm_role_assignment.this["kv-secrets-read"] will be created
+   resource "azurerm_role_assignment" "this" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.container_uai.azurerm_role_assignment.this["storage-file-contributor"] will be created
+   resource "azurerm_role_assignment" "this" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Storage File Data SMB Share Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.container_uai.azurerm_user_assigned_identity.this will be created
+   resource "azurerm_user_assigned_identity" "this" {
+       client_id           = (known after apply)
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openmrscore-dev-uai"
+       principal_id        = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       tenant_id           = (known after apply)
    }

  # module.db.azurerm_mysql_flexible_database.this will be created
+   resource "azurerm_mysql_flexible_database" "this" {
+       charset             = "utf8mb4"
+       collation           = "utf8mb4_unicode_ci"
+       id                  = (known after apply)
+       name                = "openmrsdb"
+       resource_group_name = "rg-openmrscore-dev"
+       server_name         = "openmrscore-dev-mysql"
    }

  # module.db.azurerm_mysql_flexible_server.this will be created
+   resource "azurerm_mysql_flexible_server" "this" {
+       administrator_login           = "sqladmin"
+       administrator_password        = (sensitive value)
+       administrator_password_wo     = (write-only attribute)
+       backup_retention_days         = 7
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = false
+       id                            = (known after apply)
+       location                      = "francecentral"
+       name                          = "openmrscore-dev-mysql"
+       public_network_access         = "Enabled"
+       public_network_access_enabled = (known after apply)
+       replica_capacity              = (known after apply)
+       replication_role              = (known after apply)
+       resource_group_name           = "rg-openmrscore-dev"
+       sku_name                      = "B_Standard_B1ms"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       version                       = "8.0.21"
+       zone                          = (known after apply)

+       storage {
+           auto_grow_enabled   = true
+           io_scaling_enabled  = false
+           iops                = (known after apply)
+           log_on_disk_enabled = false
+           size_gb             = 20
        }
    }

  # module.db.azurerm_mysql_flexible_server_firewall_rule.allow_azure_services will be created
+   resource "azurerm_mysql_flexible_server_firewall_rule" "allow_azure_services" {
+       end_ip_address      = "0.0.0.0"
+       id                  = (known after apply)
+       name                = "AllowAzureServices"
+       resource_group_name = "rg-openmrscore-dev"
+       server_name         = "openmrscore-dev-mysql"
+       start_ip_address    = "0.0.0.0"
    }

  # module.dns_zone.azurerm_dns_zone.public will be created
+   resource "azurerm_dns_zone" "public" {
+       id                        = (known after apply)
+       max_number_of_record_sets = (known after apply)
+       name                      = "openmrs.fchevalier.net"
+       name_servers              = (known after apply)
+       number_of_record_sets     = (known after apply)
+       resource_group_name       = "rg-openmrscore-dev"

+       soa_record (known after apply)
    }

  # module.keyvault.azurerm_key_vault.this will be created
+   resource "azurerm_key_vault" "this" {
+       access_policy                 = (known after apply)
+       enable_rbac_authorization     = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       name                          = "openmrscore-dev-kv"
+       public_network_access_enabled = true
+       purge_protection_enabled      = true
+       resource_group_name           = "rg-openmrscore-dev"
+       sku_name                      = "standard"
+       soft_delete_retention_days    = 7
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       tenant_id                     = "************************************"
+       vault_uri                     = (known after apply)

+       contact (known after apply)

+       network_acls (known after apply)
    }

  # module.keyvault.azurerm_role_assignment.data_plane["kv-admin"] will be created
+   resource "azurerm_role_assignment" "data_plane" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.azurerm_role_assignment.data_plane["kv-secrets-officer"] will be created
+   resource "azurerm_role_assignment" "data_plane" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets Officer"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.monitoring_storage.azurerm_log_analytics_workspace.logs will be created
+   resource "azurerm_log_analytics_workspace" "logs" {
+       allow_resource_only_permissions = true
+       daily_quota_gb                  = -1
+       id                              = (known after apply)
+       internet_ingestion_enabled      = true
+       internet_query_enabled          = true
+       local_authentication_disabled   = false
+       location                        = "francecentral"
+       name                            = "openmrscoredevlogs"
+       primary_shared_key              = (sensitive value)
+       resource_group_name             = "rg-openmrscore-dev"
+       retention_in_days               = 30
+       secondary_shared_key            = (sensitive value)
+       sku                             = "PerGB2018"
+       tags                            = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
+       workspace_id                    = (known after apply)
    }

  # module.monitoring_storage.azurerm_storage_account.storage will be created
+   resource "azurerm_storage_account" "storage" {
+       access_tier                        = (known after apply)
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = true
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       https_traffic_only_enabled         = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = (known after apply)
+       local_user_enabled                 = true
+       location                           = "francecentral"
+       min_tls_version                    = "TLS1_2"
+       name                               = "openmrscoredevstorage"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = true
+       queue_encryption_key_type          = "*******"
+       resource_group_name                = "rg-openmrscore-dev"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "*******"
+       tags                               = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }

+       blob_properties (known after apply)

+       network_rules (known after apply)

+       queue_properties (known after apply)

+       routing (known after apply)

+       share_properties (known after apply)

+       static_website (known after apply)
    }

  # module.monitoring_storage.azurerm_storage_share.openmrs_data will be created
+   resource "azurerm_storage_share" "openmrs_data" {
+       access_tier         = (known after apply)
+       enabled_protocol    = "SMB"
+       id                  = (known after apply)
+       metadata            = (known after apply)
+       name                = "openmrs-data"
+       quota               = 10
+       resource_manager_id = (known after apply)
+       storage_account_id  = (known after apply)
+       url                 = (known after apply)
    }

  # module.network.azurerm_network_security_group.this["aca"] will be created
+   resource "azurerm_network_security_group" "this" {
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openmrscore-dev-nsg-aca"
+       resource_group_name = "rg-openmrscore-dev"
+       security_rule       = [
+           {
+               access                                     = "Allow"
+               destination_address_prefix                 = "*"
+               destination_address_prefixes               = []
+               destination_application_security_group_ids = []
+               destination_port_range                     = "*"
+               destination_port_ranges                    = []
+               direction                                  = "Inbound"
+               name                                       = "AllowAllInbound"
+               priority                                   = 100
+               protocol                                   = "*"
+               source_address_prefix                      = "*"
+               source_address_prefixes                    = []
+               source_application_security_group_ids      = []
+               source_port_range                          = "*"
+               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ]
+       tags                = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
    }

  # module.network.azurerm_subnet.this["aca"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.10.1.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "openmrscore-dev-aca"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-openmrscore-dev"
+       virtual_network_name                          = "openmrscore-dev-vnet"

+       delegation {
+           name = "delegation-aca"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.App/environments"
            }
        }
    }

  # module.network.azurerm_subnet_network_security_group_association.this["aca"] will be created
+   resource "azurerm_subnet_network_security_group_association" "this" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # module.network.azurerm_virtual_network.this will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space                  = [
+           "10.10.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "francecentral"
+       name                           = "openmrscore-dev-vnet"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-openmrscore-dev"
+       subnet                         = (known after apply)
+       tags                           = {
+           "environment" = "dev"
+           "project"     = "openmrscore"
        }
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_AUTO_UPDATE_DATABASE"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-AUTO-UPDATE-DATABASE"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_DATABASE"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-CONNECTION-DATABASE"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_PASSWORD"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-CONNECTION-PASSWORD"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_SERVER"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-CONNECTION-SERVER"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_USERNAME"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-CONNECTION-USERNAME"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CREATE_TABLES"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-CREATE-TABLES"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_MODULE_WEB_ADMIN"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "OMRS-CONFIG-MODULE-WEB-ADMIN"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #32](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14856498605)